{
    "@class": "com.kony.gen.viz.model.component.KVizRichText",
    "DNDConfig": null,
    "_height_": {
        "type": "ref",
        "value": "preferred"
    },
    "_left_": {
        "type": "string",
        "value": "0"
    },
    "_margin_": [
        0,
        0,
        0,
        0
    ],
    "_padding_": [
        0,
        0,
        0,
        0
    ],
    "_skin_": "s1eafc0fb03c4898ae6b3118990f48ad",
    "_text_": "TERMS AND CONDITIONS\nThank you for using our Coopbank 'Infinity' and Services which are governed by these Terms and Conditions. Please read them thoroughly and carefully.\n\nGENERAL TERMS AND CONDITION\nCooperative Bank of Oromia (the Coopbank, service provider, we, our, us) is a financial services company registered and licensed by the National Bank of Ethiopia. Coopbank Infinity services and related disclosures are governed by Ethiopian commercial laws. By using Coopbank Infinity Services, you accept these terms. Our Terms and Conditions, Privacy Policy, Pricing and Fees, and any other applicable terms and conditions govern your relationship with Infinity Services. These Terms and Conditions must be acccepted to access the Infinity Services.\n\nYou may disable Infinity access if you disagree with the updated terms and conditions. If you wish to access infinity again after termination, you may have to agree to these Terms and Conditions again. Email and/or a message in the relevant part of your Infinity, available via the app or online, will notify you of significant changes. Updates take effect immediately unless otherwise stated in the notification of change. Breach of this terms and conditions by the user shall render him to be liable under relevant law of the country.\n\n CONSENT TO AUTOMATIC MESSAGE\nYou consent to receiving these Terms and Conditions and any other agreements, notices, or other communications from Coopbank regarding our services ('Communications') electronically to the extent permitted by law. Electronic Messages may be placed on Infinity application or website pages or SMS/emailed to you. We may use SMS to verify payments, password resets, other actions, and for security purposes. Any SMS communication or notice will be considered received the same day.\n\nENROLLING/REGISTERING FOR INFINITY \n-  Coopbank's Know Your Customer (KYC) process and the Bank's approval policies apply to commercial and individual applicants for the Infinity Services. Customers must enroll on the Infinity platform app or website with relevant information to access Infinity Services. Retail customers can register for infinity Services online, while corporate clients must visit a branch.\n- Infinity Customers agree to these Terms and Conditions, our privacy Policy, and other Coopbank policies. Furthermore terms and conditions may be required for additional services.\n- By registering, you agree to be 18 or older to use the Infinity Services.\n- To use Infinity Services on behalf of a company, you must be legally authorized to consent to these Terms and Conditions, either under the business entity's formation documents or under your jurisdiction's law.\n- Joint  account holders are not eligible for retail infinity digital banking services.\n\nINFINITY SERVICES\n- Infinity customers can send and receive funds and pay for goods and services anytime anywhere.\n- Coopbank does not sell goods or services paid for via the Infinity Services. It only acts as a financial institution to handle payments and transfers. With relation to the provision of products or services or their delivery, the bank does not offer any trust services.\n- Infinity customers can made payment and transfer funds. Your account transaction, line of business, anti-money laundering regulations, Coopbank risk management procedures, and other factors may affect infinity platform eligibility, approvals, limits, and availability.\n- The platform's available balance belongs to the individual or legal organization that signed up for Infinity Services. Only the registered user has access to the funds associated with the Infinity services. Customers mat not assign or transfer their right to use Infinity services to third parties. The customer bears the risk connected with such activities or behaviors.\n- Infinity services may include some or all of the following services, which are subject to change: \n     -  Transfer funds, payments to third parties ( merchants and billers), loan repayment;\n     -  Beneficiary and account management, cheque book request;\n     -  Any new Infinity services that are introduced from time to time;\n- You also agree to comply with Coopbank Anti-Money Laundering and Combat Financing of Terrorism Compliance program while managing your transactions and account electronically.\n\nTRANSFERS AND PAYMENTS \nYou can transfer money from one Coopbak account to another, to the bank account of a beneficiary , or to your/other P2P subscription number by using the Infinity services. In addition, customers can made payments that are initiated over  the internet for goods or services purchased either online.\n-  The bank will transfer funds to/from your account, send you an SMS, and record the transactions in your transaction history ( viewable at your Bank Account). Reconcile your bank account transfers with SMS notifications and your records frequently. Verified and active bank accounts are required to designate. Designate only with your own bank account, otherwise any infringrement of this condition may be considered fraud.\n-  Customers are responsible for entering accurate transfer/payment information while completing transactions. You will be held accountable if you do not provide accurate information to the bank. Verify your account number, billing/merchant ID, and other important fields. For accuracy, the bank may verify your transfer/payment information in a different database. If you provide inaccurate information and a transfer or payment goes to the wrong bank account or biller, we are not responsible.\n- We reserve the right to reject or limit payments at our discretion or in accordance with all relevant country laws. Transfers/payments may be rejected for anti-money laundering or Coopbank risk management compliance reasons. The bank is under no obligation to explain why a payment was rejected.\n- Transfers/payments may be subject to certain fees. For more information, see the Fees section of these Terms & Conditions. Coopbank will debit your account promptly with the agreed-upon sum.\n- If you've made payment to biller or merchant, the bank can't refund you. You must contact your biller.\n- Infinity platform cannot be used to transfer funds or make payments without sufficient funds.\n- The bank is not responsible for late or cancelled transfers/payments due to circumstances beyond its control.\n- Transfers might be one-time, recurring, or scheduled. You can only cancel the series, not single schedule transactions. The user must create a new scheduled transaction after canceling one. Hence the bank is not accountable for any transfers you make to the wrong account or to unauthorized person, as well as any scheduled transactions you set up.\n- Coopbank may delay or suspend a payment or transfer if we suspect it is unauthorized or fraudulent . We will not be held liable for any payment delays or failures as a result of such procedures.\n\n\nTRANSACTION LIMITATION\nThe service provider maintains the right to limit transactions and account transfers. If the service provider unable to execute your transfer instructions, the customer will be notified. If your instructions are banned by these. Terms and Conditions or relevant law, communication is not required.\n\nDISPUTE\nAfter specifying the basis of dispute, consumers can submit online disputes for completed transactions within 10 days. Report a denied dispute transaction to your local branches immediately. Otherwise, the transaction will effect after 10 days. If a disputed transaction is applied after funds have been withdrawn, the bank will not be liable for the loss. If you wait too long to dispute an erroneously posted transaction, we mat be unable to compensate you for your loss.\n\nKEEPING YOUR INFINITY ACCOUNT SAFE\n- Your Infinity Account is password-protected. Never share your Account password. No Coopbank staff will request your password. Report any password requests from non-Coopbank sites. Coopbank Consumer Center can verify the website legitimacy.\n- The bank may send an SMS verification code to your mobile phone when you login in to your infinity Account or use certain Infinity Services to verify your identity ('Two Step Verification').\n- Change your password immediately and contact Coopbank Customer Contact Center if you suspect your Infinity Account, login information, password, or other security feature has been lost, stolen, misappropriated, used without authorization, or otherwise compromised. If you don't notify us, your Infinity Account's security may be compromised and you will be completely responsible for any losses.\n- Your email account(s) and mobile phone may be used for Two Step Verification, password resets, and Infinity Account Account security communications. so you must take reasonable precautions to safeguard them. Contact the Coopbank Customer Contact Center immediately if you suspect your Infinity Account's email or phone/mobile numbers have been compromised.\n- Make sure your browser doesn't store or cache your login details when accessing your Infinity Account on a public, shared, or personal computer. Never let your computer store login credentials or passwords.\n- Biometric data will only be used for authentication and not be stored or shared.\n- You must safeguard your Mobile Devices and uninstall any Infinity Apps before replacing or disposing of them.\n- Failure to secure account information will result in customer liability.\n\nINTELLECTUAL PROPERTY RIGHTS\nThe Infinity Service and its original content features and functionality are and will remain the exclusive property of the Bank. The Service is protected by relevant Intellectual property laws of the Country.\n\nCOMPLAINTS\nCall the Coopbank Customer Contact Center to resolve any bank or service issues. Let us know what you want to complain clearly. We can better separate complaints from regular inquiries. We may acknowledge or request clarification on the complaint. We try to resolve issues quickly. This document does not imply Coopbank promise to resolve your complaint. Call 609 Coopbank Customer Service or visit head office customer experience office or nearby branches.\n\nLANGUAGE\nThe Infinity service website and mobile apps are multilingual. Customers can choose their favorite language from a list of available options. Regardless of the language you select, all functions of the website or application are available. Customers may simply access and manage their Infinity services and other information using the language feature of their choice.\n\nFEES\nInfinity Services are free. Certain Services features may charge fees (i.e., if you customer request a fund transfer to other bank, bill payment to third parties, merchant payment, new checkbook request or any other service). By using the Infinity Services, you agree to pay all Prices and Fees. The bank's terms and conditions allow it to evaluate and change fees and prices. Revised fees will be posted online and emailed to your Infinity app/web. For fees related questions, contact Coopbank Consumer Contract Center. You authorize us to deduct your fees from Coopbank account. Transaction fees will be charged afterward. We may reject the transaction if your Coopbank account balance is insufficient to cover the fees.\n\nAMENDMENT\nThe service provider may amend these terms and conditions at any time. Apps and websites will display the updated terms and conditions. After notification, using the Services indicates acceptance of the amended terms and conditions. The service provider may amend software, services, and related materials and making previous versions outdated. The service provider may also terminate these Terms and Conditions for all previous versions of the applications, services, and/or related material and limit access to the latest updates.\n\nRISK OF LOSS \nIf the system fails, it is possible that your data may be lost. Before a system failure or interruption, the customer should verify any transaction(s) they were completing or had recently to confirm accuracy and completion. This is done to protect the customer from any losses(s). In the event of a system failure or interruption, the customer is responsible for verifying any affected transactions.\n\nGOVERNING LAW\nThe Terms and Conditions shall be governed by and construed in accordance with all applicable federal laws, rules, regulations and Coopbank's policy and procedures.\n\nALERTS SERVICE\nOur notification service is automatically activated when you register Infinity. Ethiopian phone numbers receive account balance and transaction alerts through text.\n-  Each SMS will be delivered to you only once. We are unable to resend an SMS or email that you have previously deleted.\n-  Sign into Infinity and choose relevant option to cancel notifications. If device notifications are canceled, customers are responsible for missing information and associated loss.\n-  If we don't send an alert or it's erroneous, we'll only be responsible for any charges you incur on your account that you could have avoided, unless it's due to user error ( for example your phone is out of coverage, is switched off or you have changed your number).\n-  Account balances in the alert are correct as of the date and time mentioned in the text or email, but they may change. Any amount shown corresponds to the actual balance on your account. The displayed balance may vary due to pending transactions.\n\nAUTHORIZATION OF TRANSACTIONS\nAn authorized signatory is a specific individual who has been given the authorization and is permitted to access Infinity Services on behalf of a company, either alone or jointly.\n  -    Business entity administrators manage users to manage accounts on Infinity platform. The corporation assumes user creation risks.\n  -    If a Signatory initiates a transaction, the following will happen;\n        -  The Transaction will be pending (not displayed in the Account's available balance) for up to 2 days ( the Authorization Period) after it is initiated.\n       -   The transaction will not be completed until all Signatories have approved it ( provided they do so during the Authorization Period); and\n       -   The frozen money is released to the customer's Account available balance if all Signatories do not authorize the transaction during the Authorization Period.\n -    In addition to signatories who manage Account Transactions, a corporate entity may authorize employees to access Infinity Services to view Account details but not make transactions.\n\nDENIAL of ACCESS to INFINITY SERVICES\nWe may suspend or terminate your use of Infinity Services without notice if we have reasonable grounds to do so, such as:\n(a)   If we suspect fraud or security breach;\n(b)   If you refuse to disclose information or security details when requested;\n(c)   When the Infinity Access method is abused;\n(d)   When a court order or law requires us to do so;\n(e)   To comply specific regulations, such as anti-money laundering and anti-terrorism funding laws;\n(f)    If you have not used Infinity Services in an acceptable manner as determined by us; or\n(g)   For any other reason that we deem reasonable.\nWe reserve the right to suspend or limit access to your Account via Infinity Services at any time, without notice, if you have not complied with our requirements for using your access methods or if we believe a security concern has arisen that requires investigation. We will not be liable to you or anyone else for any loss or damage that you or anyone else may suffer as a result of such denial.\n\nEND USER LICENSE AGREEMENT\n-  We grant you permission to use the Infinity app under the following conditions. This license can't be assigned, transferred, or made exclusive.\n-  Jailbroken, rooted, or compromised devices aren't authorized to download, install, or use the application. Jailbroken or rooted smartphones' security settings are intentionally modified, making them more vulnerable to fraud. If your mobile device is jailbroken, rooted, or has compromised security settings, we may block you from using the Infinity Mobile Banking App.\n- To use the app, you must first:\n   (a) Use the app only on a device you own or control to access the Mobile Banking service;\n   (b) Do not sublicense, transfer, or assert the right to exercise any rights related to the application;\n   (c)  Do not duplicate, reverse engineer, modify, change, or adapt any portion of the application; and\n   (d) Accept this license without modification.\n-  Mobile Banking licensing starts when you install it and ends when you stop using it. Delete Mobile Banking app from your mobile devices if you no longer use it. By using application assumes you accept these terms.\n-  Any changes to the application will be made available via the App Store and Google Play. We are not obligated to provide you with updates in any other way.\n-  We are solely responsible for the app, and if you have any problems regarding its functionality, please contact us rather than the app stores.\n- If a third party claims that the app or your use of it infringes their rights, you agree to cooperate with us in investing and defending the allegation.\n- By using the app, you agree that the approved app providers and their subsidiaries may enforce the license as third parties.\n\nOUR LIABILITY FOR FAILURE TO COMPLETE TRANSACTIONS\nThis Agreement and any user's guide govern how we process Infinity Service payments and transfers. If any of the following occur, we are not liable:\n-   if, through no fault of ours, your Service Account has no sufficient funds to execute the transaction;\n-   If the Bank Account transaction limit is exceeded;\n-   If your Access Device, internet connection, or other equipment malfunctions;\n-   If you were aware of the problem with the service when you started the transaction;\n-   If you do not follow all of the instructions related to the Service;\n-   If you failed to approve a payment in time for the Payee to receive it by the Due Date;\n-   If you have not provided us with the correct account information, amount, or other instructions needed to process the payment, or if the above instructions are no longer stored on the hard disk of your device or host system;\n-   If a Payee delays or mishandles payment/transfer;\n- If your available balance is frozen or if a court order prevents us from completing a transaction;\n- If your device was reported lost or stolen;\n- If we have reason to believe that a transaction was not properly authorized or validated, or that it is fraudulent, erroneous, or unlawful;\n- If you exceeded the Service Account's transaction frequency or amount limits;\n- If events beyond our control ( such as telecommunications or electrical outages and malfunctions, or delays, computer system problems, or natural catastrophies) prevent the transaction from taking place:\n- If carrying out the transfer will cause us to violate any relevant law, rule, or regulation: or\n- If we commit undeliberate errors despite precautions, we will only be responsible for actual damages (which donot include indirect, incidental, special or consequential damages).\nAdditional limitation on liability may be specified in the agreements that govern your accounts with us or granted by applicable legislation.",
    "_top_": {
        "type": "string",
        "value": "10%"
    },
    "_width_": {
        "type": "string",
        "value": "90%"
    },
    "_wrapping_": 2,
    "canUpdateUI": true,
    "centerx": {
        "type": "string",
        "value": "50%"
    },
    "containerweight": 100,
    "contentalignment": 5,
    "id": "RichText0f11050539df642",
    "info": null,
    "iscustomlayout": false,
    "isvisible": true,
    "kuid": "ed514dab3ab14081b35b6409b4f1c7cb",
    "linkskin": "s2d19969bf544b5995bf87dcc4be9b00",
    "name": "kony.ui.RichText",
    "parent": "sflxTermsDetail",
    "pf": "frmLoginSignup",
    "retaincontentalignment": false,
    "retainflexpositionproperties": false,
    "wType": "RichText",
    "widgetalignment": 5
}